# Date: 07.08.2022
# Lessons from pytontutor.ru
# Заняття 11. Словники
# Завдання "Частотний аналіз"

# Умова
# Даний текст: у першому рядку записано кількість рядків у тексті, а потім самі рядки. Виведіть всі
# слова, що зустрічаються в тексті, по одному на кожен рядок. Слова повинні бути відсортовані за
# зменшенням їх кількості появи в тексті, а при однаковій частоті появи - в лексикографічному
# порядку.

counter = {} # создаем пустойсловарь 
for _ in range(int(input())): # цикл проходящий от 0 до n
    line = input().split() # разбиваем строку на слова 
    for word in line: # если слово уже естьв словаре 
        counter[word] = counter.get(word, 0) + 1 # увеличиваем его значение 
for word in sorted(counter.items(), key=lambda x:(-x[1],x[0])): # отсортируем словарь выведем ключи в обратном порядке 
    print(word[0])
