# Date: 07.08.2022
# Lessons from pytontutor.ru
# Заняття 11. Словники
# Завдання "Частотний аналіз"

# Умова
# Даний текст: у першому рядку записано кількість рядків у тексті, а потім самі рядки. Виведіть всі
# слова, що зустрічаються в тексті, по одному на кожен рядок. Слова повинні бути відсортовані за
# зменшенням їх кількості появи в тексті, а при однаковій частоті появи - в лексикографічному
# порядку.

a = {}
for i in range(int(input())):
    s = input().split()
    for j in range(len(s)):
        a[s[j]] = a.get(s[j],0) + 1
s = []
for i in a:
    s.append([-int(a[i]),i])
s = sorted(s)
for s1 in s:
    print(s1[1])
