# Дата: 28.05.2022
# Файл "MKAD"
# Уроки з pythontutor.ru
# Завдання "МКАД"

# Умова
# Довжина Московської кільцевої автомобільної дороги – 109 кілометрів.
# Байкер Вася стартує з нульового кілометра МКАД і їде зі швидкістю v к/год.
# На якій відмітці він зупиниться через t годин?

# Програма отримує на вхід значення v і t.
# Якщо v>0, Вася рухається у позитивному напрямку МКАД,
# якщо значення v<0, то у негативному.

# Програма має вивести ціле число від 0 до 108 - номер позначки,
# на якій зупиниться Вася.

v = int(input("v = "))
t = int(input("t = "))
print((a * b) % 109)
